victorpdiniz/esp32-contiki-ng/examples/esp32-s3/wifi-udp-communication/sender/sdkconfig.defaults
# WiFi UDP Communication Example - sdkconfig.defaults

# ESP32-S3 target configuration
CONFIG_IDF_TARGET="esp32s3"

# UART Configuration
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Network Configuration  
CONFIG_LWIP_IP_REASSEMBLY=y
CONFIG_LWIP_UDP_RECVMBOX_SIZE=12
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# Memory configuration - PSRAM disabled (not available on this board)
# CONFIG_SPIRAM is not set

# Logging
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
